{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}test_smcl
       {txt}log:  {res}-PWD-/log/test.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}-normalized-
{txt}
{com}. 
. ******** Update package and test the stata.trk normalizer *******
. *This is really only useful if you are installing an package from within the same project
. cap make_trk_paths
{txt}
{com}. if `=_rc'==199 {c -(} //doesn't exist
.         * net {c -(}describe|from|get|install{c )-} don't accept relative paths, so use absolute
.         net install stata_reproducible, from(`c(pwd)'/../)
.         *But then stata.trk file can't be committed to VC if used in other places. So make relative
.         make_trk_paths relative, net_ado(ado/)
. {c )-}
{txt}
{com}. else {c -(} //100 "syntax error" -> Exists
.         * If you want to reinstall (possibly because of an update), then the following options have problems
.         * Option 1: Manual reinstall
.         *   -net install, from(<abs_path> replace- 
.         *   a nearly identical entry is added to stata.trk since paths don't match and this can cause problems for program tools
.         * Option 2: Auto-update
.         *   -adoupdate, update- 
.         *   fails because -net install- can't take relative. Also errors silently and without setting _rc !!!
.         *
.         * Instead, do one of the following:
.         * Solution 1:
.         *   -ado uninstall stata_reproducible-
.         *   Then install as above
.         * Solution 2: Temporarily convert stata.trk to using absolute paths
.         make_trk_paths absolute, net_ado(ado/)
.         adoupdate stata_reproducible, update
{res}{txt}{p 0 7 2}
(note: {cmd:adoupdate} updates user-written files;
type -{cmd:update}- to check for updates to official Stata)
{p_end}

{txt}Checking status of specified packages...

{p 4 8 2}
{txt}[1] {res:stata_reproducible} at -PROJ_BASE-:{break}
installed package is up to date
{p_end}

{txt}(no packages require updating)
{com}.         * Or -net install <pkg>, from(<abs_path>) replace 
.         *   <abs_path> must be normalized to remove any "<dir>/../" like we use above 
.         *   (FWIW: -get_absolute_path_from_relative- returns this)
.         make_trk_paths relative, net_ado(ado/)
. {c )-}
{txt}
{com}. 
. 
. ******** Tests adostorer **************
. *This will change the trk file, so preserve and restore for version control 
. * (these are not normal daily operations)
. if 1 {c -(} //turn if don't want to test (e.g. no network connection)
.         tempfile trk_backup
.         copy "ado/stata.trk" `trk_backup'
.         adostorer remove synth, adofolder(ado)
{res}
{s6hlp}
package ^synth^ from http://fmwww.bc.edu/repec/bocode/s
      ^'SYNTH': module to implement Synthetic Control Methods for Comparative Case Studies^
{smcl}
{res}
(package uninstalled)
{com}.         adostorer install synth, adofolder(ado) all
{txt}checking {hilite:synth} consistency and verifying not already installed...
installing into ado/...
installation complete.
{res}{com}.         sysuse smoking
{txt}(Tobacco Sales in 39 US States)
{com}.         xtset state year
{res}{txt}{col 8}panel variable:  {res}state (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1970 to 2000
{txt}{col 17}delta:  {res}1 unit
{com}.         qui synth cigsale beer(1984(1)1988) cigsale(1988), trunit(3) trperiod(1989)
.         program drop _all //so that we don't hold onto the ado/<plat>/synthopt.plugin
.         change_line using ado/stata.trk, ln(53) replace("d Distribution-Date: 20140127") //one day before currnt dist-date. This will trigger an update
{txt}(note: file -TMPDIR-/-tempfile- not found)
{com}.         adostorer update, adofolder(ado)
{res}{txt}{p 0 7 2}
(note: {cmd:adoupdate} updates user-written files;
type -{cmd:update}- to check for updates to official Stata)
{p_end}

{txt}Checking status of specified packages...

{p 4 8 2}
{txt}[2] {res:synth} at http://fmwww.bc.edu/repec/bocode/s:{break}
{res:package has been updated on server}
{p_end}

{txt}Packages to be updated are...

{p 4 24 2}
[2] {res:synth}{bind:       } -- 'SYNTH': module to implement Synthetic Control Methods for Comparative Case Studies
{p_end}

{txt}Installing updates...

{txt}    [2] {res:synth}

{txt}Cleaning up...{txt} Done
{res}{com}.         qui synth cigsale beer(1984(1)1988) cigsale(1988), trunit(3) trperiod(1989)
.         program drop _all //so that we don't hold onto the ado/<plat>/synthopt.plugin
.         copy `trk_backup' "ado/stata.trk", replace
. {c )-}
{txt}
{com}. 
. *Setup for other
. sysuse auto, clear
{txt}(1978 Automobile Data)

{com}. compress
  mpg was int now byte
  rep78 was int now byte
  trunk was int now byte
  turn was int now byte
  make was str18 now str17
{txt}  (370 bytes saved)

{com}. 
. *Use -quiet- before commands that display differently on different platforms 
. * (e.g. use OMIT_FIG_EXP or use `main_version')
. 
. ******** Export platform-version specific versions ********
. * This is to see all the differences. Be specific about versions
. local main_version = substr("`c(stata_version)'",1,2)
{txt}
{com}. 
. qui save raw/auto-v`main_version'-raw.dta, replace
{txt}
{com}. if `main_version'==14 qui saver auto-v13-from-v14.dta, replace version(13)
{txt}
{com}. *qui below because v13 vs v14 will show "data sig. set" vers "reset"
. qui saver auto.dta, replace version(`main_version') //so graphs have same dataset location. 
{txt}
{com}. copy auto.dta auto-v`main_version'.dta, replace
{txt}
{com}. erase auto.dta
{txt}
{com}. 
. twoway (scatter mpg price), title("Title") note("Notes") //has to go after save as data path written
{res}{txt}
{com}. qui graph save raw/scatter-v`main_version'-`c(os)'-raw.gph, replace
{txt}
{com}. if `main_version'==14 qui graph_saver scatter-v13-from-v14.gph, replace version(13)
{txt}
{com}. qui graph_saver scatter-v`main_version'.gph, replace version(`main_version')
{txt}
{com}. 
. qui graph_exportr scatter-v`main_version'-`c(os)'.eps, replace
{txt}
{com}. *Can't export to PDF on Unix for version <14 (sometimes Unix v14, but not always)
. cap /*noi*/ graph_exportr scatter-v`main_version'-`c(os)'.pdf, replace
{txt}
{com}. 
. ******** Simulate a workflow to get canonical versions **********
. saver data/auto.dta, replace
{txt}  (0 bytes saved)
{res}  74:12(71728):2155345365:1865188037       {txt}(data signature reset)
file data/auto.dta saved

{com}. qui save_all_figs scatter
{txt}
{com}. 
. *If another platform updates gphs,then run this
. if "$OMIT_FIG_EXPORT"=="0"{c -(}
.         qui do gen_ext_from_gph.do
. {c )-}
{txt}
{com}. 
. 
. ******** Check that everything wrote fine ********
. foreach dta in auto-v13.dta auto-v13-from-v14.dta `=cond(`main_version'==14,"auto-v14.dta","")' {c -(}
{txt}  2{com}.         qui use `dta', clear
{txt}  3{com}.         qui datasignature confirm
{txt}  4{com}. {c )-}
{txt}
{com}. 
. graph use scatter-v13.gph, nodraw
{res}{txt}
{com}. graph use scatter-v13-from-v14.gph, nodraw
{res}{txt}
{com}. if `main_version'==14 qui graph use scatter-v14.gph, nodraw
{txt}
{com}. 
. 
. ******* Check the log normalization **************
. local main_version ""
{txt}
{com}. global OMIT_FIG_EXPORT ""
{txt}
{com}. display_run_specs /*creturn list has too many things to null out*/
Flavor = -normalized-
               {txt}Revision = {res}-normalized-
c(os) = -normalized-
c(osdtl) = -normalized-
c(machine_type) = -normalized-
c(byteorder) = -normalized-
            {txt}c(hostname) = -normalized-
                 {txt}c(pwd) = {res}"-PWD-"
c(stata_version) = -normalized-
c(processors) = -normalized-
{txt}
{com}. mac dir
{txt}{p 0 16}
S_FNDATE:{space 7}{res}{res}-normalized-
{p_end}
{txt}{p 0 16}
S_FN:-normalized-
{p_end}
{txt}{p 0 16}
T_gm_fix_span:{space 2}{res}{res}0
{p_end}
{txt}{p 0 16}
PROJ_ROOT:{space 6}{res}{res}-PROJ_BASE-/
{p_end}
{txt}{p 0 16}
GPH_DEFAULT_VERSION:{break}
{res}13
{p_end}
{txt}{p 0 16}
DTA_DEFAULT_VERSION:{break}
{res}13
{p_end}
{txt}{p 0 16}
S_ADO:-normalized-
{p_end}
{txt}{p 0 16}
S_FLAVOR:-normalized-
{p_end}
{txt}{p 0 16}
S_OS:-normalized-
{p_end}
{txt}{p 0 16}
S_MACH:-normalized-
{p_end}
{txt}{p 0 16}
_trk_backup:{space 4}{res}{res}-TMPDIR-/-tempfile-
{p_end}
{txt}{p 0 16}
_pwd:{space 11}{res}{res}-PWD-
{p_end}
{txt}
{com}. tempfile tfile
{txt}
{com}. save `tfile'
{txt}file -TMPDIR-/-tempfile- saved

{com}. 
. *set trace on
. log_closer test_log, raw_dir(raw) rw_line_user_post(rw_line_user)
      {txt}name:  {res}test_log
       {txt}log:  {res}-PWD-/log/test.log
  {txt}log type:  {res}text
 {txt}closed on:  {res}-normalized-
{txt}{.-}
(note: file raw/test.log not found)
{res}{txt}
{com}. log_closer test_smcl, raw_dir(raw) rw_line_user_post(rw_line_user)
      {txt}name:  {res}test_smcl
       {txt}log:  {res}-PWD-/log/test.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}-normalized-
{txt}{.-}
{smcl}
{txt}{sf}{ul off}
